# config.py

# --- Основные настройки ---
TOKEN = ""  # Твой токен, конечно же :)
ADMIN_ID =
LOG_CHANNEL_ID =-


# --- Игровой баланс ---
SPY_COST = 1000
START_BUDGET = 3000
BASE_UPGRADE_COST = 1500
UPGRADE_COST_INCREASE = 500
NUKE_COST = 3000
SHIELD_COST = 3000
MAX_CITY_LEVEL = 15
MAX_SHIELDS_PER_ROUND = 2
MAX_UPGRADES_PER_ROUND = 2
SOCIAL_PROGRAM_COST = 1500
MAX_SOCIAL_PROGRAMS_PER_ROUND = 2
BUNKER_COSTS = {
    1: 2000,
    2: 4000,
    3: 6000
}
BUNKER_EFFECTS = {
    1: (25, 0.25),  #
    2: (40, 0.50),
    3: (55, 0.75)
}
MAX_BUNKER_LEVEL = 3

# --- Настройки времени ---
ROUND_DURATION = 600  # 10 минут
ADMIN_CALL_BAN_DURATION = 120  # 2 минуты
MAX_TOTAL_SHIELDS = 3


DEVELOPMENT_LEVELS = {
    0:  "Начальное развитие",
    3:  "Аграрное общество",
    6:  "Промышленная держава",
    10: "Технологический гигант",
    13: "Постиндустриальная сверхдержава"
}

NATION_STATUS_LEVELS = {
    0:  "На грани коллапса",
    30: "Нестабильное",
    60: "Стабильное",
    90: "Процветающее"
}

# --- Игровые данные (страны и города) ---
countries = {
    "Украина": ["Киев", "Харьков", "Бахмут", "Одесса"],
    "Россия": ["Москва", "Санкт-Петербург", "Новосибирск", "Казань"],
    "США": ["Вашингтон", "Нью-Йорк", "Лос-Анджелес", "Чикаго"],
    "Германия": ["Берлин", "Мюнхен", "Гамбург", "Кёльн"],
    "Франция": ["Париж", "Марсель", "Лион", "Тулуза"],
    "Великобритания": ["Лондон", "Манчестер", "Эдинбург", "Бирмингем"],
    "Югославия":["Белград","Сараево","Загреб","Любляна"],
    "Израиль": ["Тель-Авив", "Иерусалим", "Хайфа", "Бэр-Шева"],
    "Иран": ["Тегеран", "Исфахан", "Шираз", "Мешхед"],
    "Ирак": ["Багдад", "Мосул", "Басра", "Алах-бабах"],
    "Афганистан": ["Кабул", "Кандагар", "Герат", "Маза-Шариф"],
    "Уганда": ["Капала", "Гулу", "Лира", "Мбе"],
    "Люксембург": ["Люксембург", "Эш-сюр-Аль", "Дрх", "Виц"]
}