# config.py

# --- Основные настройки ---
TOKEN = ""  # Твой токен, конечно же :)
ADMIN_ID =

# --- Игровой баланс ---
START_BUDGET = 1000000
BASE_UPGRADE_COST = 1500
UPGRADE_COST_INCREASE = 500
NUKE_COST = 3000
SHIELD_COST = 3000
MAX_CITY_LEVEL = 15
MAX_SHIELDS_PER_ROUND = 2
MAX_UPGRADES_PER_ROUND = 2
SOCIAL_PROGRAM_COST = 1500
MAX_SOCIAL_PROGRAMS_PER_ROUND = 2
BUNKER_COSTS = {
    1: 2000,
    2: 4000,
    3: 6000
}
BUNKER_EFFECTS = {
    1: (25, 0.25),  #
    2: (40, 0.50),
    3: (55, 0.75)
}
MAX_BUNKER_LEVEL = 3

# --- Настройки времени ---
ROUND_DURATION = 600  # 10 минут
ADMIN_CALL_BAN_DURATION = 120  # 2 минуты

# --- Игровые данные (страны и города) ---
countries = {
    "Украина": ["Киев", "Харьков", "Бахмут", "Одесса"],
    "Россия": ["Москва", "Санкт-Петербург", "Новосибирск", "Казань"],
    "США": ["Вашингтон", "Нью-Йорк", "Лос-Анджелес", "Чикаго"],
    "Германия": ["Берлин", "Мюнхен", "Гамбург", "Кёльн"],
    "Франция": ["Париж", "Марсель", "Лион", "Тулуза"],
    "Великобритания": ["Лондон", "Манчестер", "Эдинбург", "Бирмингем"],
    "Югославия": ["Белград", "Сараево", "Загреб", "Любляна"],
    "Израиль": ["Тель-Авив", "Иерусалим", "Хайфа", "Беэр-Шева"],
    "Иран": ["Тегеран", "Исфахан", "Шираз", "Мешхед"],
    "Ирак": ["Багдад", "Мосул", "Басра", "Эрбиль"],
    "Афганистан": ["Кабул", "Кандагар", "Герат", "Мазари-Шариф"],
    "Уганда": ["Кампала", "Гулу", "Лира", "Мбарара"]
}